# Content List
### 01. Importing libraries
### 02. Importing data
### 03. Merging data

# 01. Importing libraries

In [17]:
# Import libraries
import pandas as pd
import numpy as np
import os

# 02. Importing data

In [18]:
# create path to main project folder
path = r'/Users/kirstinhelgeson/Desktop/Data Analytics Course/05-2023 Instacart Basket Analysis'

In [19]:
# import orders_checked.csv file
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_checked.csv'), index_col = False)

In [20]:
# import order_products__prior.csv file
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'order_products__prior.csv'), index_col = False)

# 03. Merging data

In [21]:
# check the output of df_ords
df_ords.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,0,2539329,1,1,2,8,NaN
1,1,1,2398795,1,2,3,7,15.0
2,2,2,473747,1,3,3,12,21.0
3,3,3,2254736,1,4,4,7,29.0
4,4,4,431534,1,5,4,15,28.0

In [22]:
# check total size of df_ords
df_ords.shape

(3421083, 8)

In [23]:
# remove columns "Unnamed:0.1" and "Unnamed:0" because they are not needed
df_ords_2 = df_ords.drop(['Unnamed: 0.1','Unnamed: 0'], axis=1)

In [24]:
# check new output of df_ords_2
df_ords_2.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [25]:
# check new total size of df_ords_2
df_ords_2.shape

(3421083, 6)

In [26]:
# check the output of df_ords_prior
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [27]:
# check total size of df_ords_prior
df_ords_prior.shape

(32434489, 4)

In [29]:
# create a new dataframe that contains the combined df_ords and df_ords_prior dataframes using "order_id" as key
df_merged_large = df_ords_2.merge(df_ords_prior, on = 'order_id', indicator = True)

In [30]:
# check output of df_merged_large
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [31]:
# check all values in "_merge" column to see if there is a full match or not
df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

### This does not mean we have a full match however, because the default inner join was used which means that the resulting table will only contain observations found in both dataframes.

In [32]:
# create a new dataframe that contains the combined df_ords and df_ords_prior dataframes using "order_id" as key and using an outer join
df_merged_large_2 = df_ords_2.merge(df_ords_prior, on = 'order_id', how = 'outer', indicator = True)

In [33]:
# check all values in "_merge" column to see if there is a full match or not
df_merged_large_2['_merge'].value_counts()

both          32434489
left_only       206209
right_only           0
Name: _merge, dtype: int64

In [ ]:
# export the merged file in pickle format
df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))